In [1]:
import pandas as pd
df= pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep='\t')
df.head()
chipo= df
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [2]:
chipo= chipo[['item_name', 'item_price']]
chipo.head()

                               item_name item_price
0           Chips and Fresh Tomato Salsa     $2.39
1                                   Izze     $3.39
2                       Nantucket Nectar     $3.39
3  Chips and Tomatillo-Green Chili Salsa     $2.39
4                           Chicken Bowl    $16.98

In [3]:
chipo.sort_values(by="item_name", ascending=True)

              item_name item_price
3389  6 Pack Soft Drink    $12.98
341   6 Pack Soft Drink     $6.49
1849  6 Pack Soft Drink     $6.49
1860  6 Pack Soft Drink     $6.49
2713  6 Pack Soft Drink     $6.49
...                 ...        ...
2384  Veggie Soft Tacos     $8.75
781   Veggie Soft Tacos     $8.75
2851  Veggie Soft Tacos     $8.49
1699  Veggie Soft Tacos    $11.25
1395  Veggie Soft Tacos     $8.49

[4622 rows x 2 columns]

In [13]:
chipo.sort_values(by="item_price", ascending=False,inplace=True)

In [14]:
chipo.head()

                item_name item_price
2624     Steak Salad Bowl     $9.39
1825  Barbacoa Salad Bowl     $9.39
1865  Carnitas Salad Bowl     $9.39
2600     Steak Salad Bowl     $9.39
4419     Steak Salad Bowl     $9.39

In [22]:
len(df[df["item_name"] == 'Veggie Salad Bowl'])

18

In [27]:
len(df[(df["item_name"] =="Canned Soda") & (df['quantity'] > 1)])

20